---
kind: enumMember
id: F:Autodesk.Revit.DB.Structure.TargetRebarConstraintType.OutOfPlaneExtent
enum: Autodesk.Revit.DB.Structure.TargetRebarConstraintType
source: html/b5eb20bf-e887-41b4-f15c-0c1860799a8b.htm
---
# Autodesk.Revit.DB.Structure.TargetRebarConstraintType.OutOfPlaneExtent

Handle is constrained to the extent of a three-dimensional Rebar out of
 its primary plane. This includes the length of a Rebar Set, the
 out-of-plane length of a multi-planar Rebar, and the length of a
 spiral Rebar.